Revit 2027 API
DirectShapeLibrary.FindDefinition Method
 Find a definition by id
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<GeometryObject> FindDefinition(
	string id
)
Public Function FindDefinition (
	id As String
) As IList(Of GeometryObject)
public:
IList<GeometryObject^>^ FindDefinition(
	String^ id
)
member FindDefinition :
        id : string -> IList<GeometryObject>
Parameters
id String
 Definition id. Expecected to be unique
Return Value
IList<GeometryObject>
 List of geometry objects that together define a shape
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace